import pandas as pd

In [1]:
import pandas as pd
india_weather = pd.DataFrame({ 'city': ['mumbai','new_delhi','benglore'],
                   'weather': [32,45,30],
                   'temperature': [80,60,78]})

In [2]:
india_weather

        city  weather  temperature
0     mumbai       32           80
1  new_delhi       45           60
2   benglore       30           78

In [3]:
us_weather = pd.DataFrame({ 'city': ['chicago','new_york','orlando'],
                   'weather': [21,14,35],
                   'temperature': [68,65,77]})

In [4]:
us_weather

       city  weather  temperature
0   chicago       21           68
1  new_york       14           65
2   orlando       35           77

In [5]:
df =pd.concat([india_weather,us_weather])

In [6]:
df

        city  weather  temperature
0     mumbai       32           80
1  new_delhi       45           60
2   benglore       30           78
0    chicago       21           68
1   new_york       14           65
2    orlando       35           77

In [7]:
df =pd.concat([india_weather,us_weather],ignore_index = True)

In [8]:
df

        city  weather  temperature
0     mumbai       32           80
1  new_delhi       45           60
2   benglore       30           78
3    chicago       21           68
4   new_york       14           65
5    orlando       35           77

In [9]:
df =pd.concat([india_weather,us_weather],keys =['india','us'])

In [9]:
df

              city  weather  temperature
india 0     mumbai       32           80
      1  new_delhi       45           60
      2   benglore       30           78
us    0    chicago       21           68
      1   new_york       14           65
      2    orlando       35           77

In [10]:
df.loc['india']

        city  weather  temperature
0     mumbai       32           80
1  new_delhi       45           60
2   benglore       30           78

In [11]:
india_temp = pd.DataFrame({ 'city': ['mumbai','new_delhi','benglore'],
                            'temperature': [80,60,78]})

In [12]:
india_temp

        city  temperature
0     mumbai           80
1  new_delhi           60
2   benglore           78

In [13]:
india_wind = pd.DataFrame({ 'city': ['mumbai','new_delhi','benglore'],
                   'windspeed': [7,11,19]})

In [14]:
india_wind

        city  windspeed
0     mumbai          7
1  new_delhi         11
2   benglore         19

In [15]:
df2 =pd.merge(india_temp,india_wind,on='city')

In [16]:
df2

        city  temperature  windspeed
0     mumbai           80          7
1  new_delhi           60         11
2   benglore           78         19

In [17]:
india_temp2 = pd.DataFrame({ 'city': ['mumbai','new_delhi','benglore','chennai'],
                            'temperature': [80,60,78,67]})

In [18]:
india_temp2

        city  temperature
0     mumbai           80
1  new_delhi           60
2   benglore           78
3    chennai           67

In [19]:
india_wind2 = pd.DataFrame({ 'city': ['mumbai','new_delhi','kolkata'],
                   'windspeed': [7,11,19]})

In [20]:
india_wind2

        city  windspeed
0     mumbai          7
1  new_delhi         11
2    kolkata         19

In [62]:
df3 =pd.merge(india_temp2,india_wind2,on='city')

In [63]:
df3

        city  temperature  windspeed
0     mumbai           80          7
1  new_delhi           60         11

In [21]:
df3 =pd.merge(india_temp2,india_wind2,on='city', how='outer')

In [22]:
df3

        city  temperature  windspeed
0     mumbai         80.0        7.0
1  new_delhi         60.0       11.0
2   benglore         78.0        NaN
3    chennai         67.0        NaN
4    kolkata          NaN       19.0

In [23]:
df3 =pd.merge(india_temp2,india_wind2,on='city', how='left')

In [24]:
df3

        city  temperature  windspeed
0     mumbai           80        7.0
1  new_delhi           60       11.0
2   benglore           78        NaN
3    chennai           67        NaN

In [25]:
df3 =pd.merge(india_temp2,india_wind2,on='city', how='outer',indicator )

SyntaxError: positional argument follows keyword argument (<ipython-input-25-7b776dcac9ca>, line 1)